{
  "listings": [
    {
      "title": "Senior Scientist (Ligand Binding/HAI)",
      "location": "Oxford - England",
      "applyURL": "https://modernatx.eightfold.ai/careers/?pid=309258592800&domain=modernatx.com&sort_by=relevance",
      "description": "The Role:\n\nJoining Moderna offers the unique opportunity to be part of a pioneering team that's revolutionizing medicine through mRNA technology with a diverse pipeline of development programs across various diseases. As an employee, you'll be part of a continually growing organization working alongside exceptional colleagues and strategic partners worldwide, contributing to global health initiatives. Moderna's commitment to advancing the technological frontier of mRNA medicines ensures a challenging and rewarding career experience with the potential to make a significant impact on patients' lives worldwide.\n\nModerna's strategic partnership with the UK Government is exemplified by our innovative presence at Harwell. Our mission is to establish a leading-edge research, development, and manufacturing facility as part of a long-term commitment to onshore mRNA vaccine production for respiratory diseases. This initiative will create a multitude of highly skilled jobs and foster collaboration with academic and NHS partners across the UK. We're looking for global experts eager to join us in this endeavor, contributing to a future where access to life-saving vaccines is a reality for all​​.\n\nModerna is seeking a talented, experienced, and motivated Senior Scientist to join the Immuno-Assays group to serve as a scientific expert and point of contact for the oversight of Immuno-Assay development, qualification/validation to support programs across multiple therapeutic areas. The Senior Scientist will lead a team in the design and execution of immunoassay development, qualification or validation, and the running of clinical samples to return high-quality data for clinical trials conducted by Moderna.\n\nHere's What You’ll Do:\n\nYour key responsibilities will be:\n\nProviding scientific strategies to implement new immune assays (MSD, ligand binding, Multi/single plex assays).\n\nServing as a lead in the execution of multiple projects requiring immunoassay expertise.\n\nFormulating novel solutions for the design of complex experiments, including ex vivo assays.\n\nDemonstrating technical excellence and advancing high-quality scientific principles in immunoassays.\n\nConducting ex vivo experimental work for functional profiling of the immune system.\n\nPerforming quality review of experimental reports and ensuring staff compliance with safety and regulatory guidelines.\n\nYour responsibilities will also include:\n\nResearching scientific and technical literature to propose and implement innovative solutions applicable to the Laboratory.\n\nAssessing staff strengths and development needs, assigning projects accordingly.\n\nIdentifying and resolving quality issues and performing quality review of study reports.\n\nAttending technical conferences and exhibits as required.\n\nThe key Moderna Mindsets you’ll need to succeed in the role:\n\nPursue options in parallel: Your role will require effectively managing multiple tasks and projects concurrently, ensuring the best outcomes through a comprehensive approach.\n\nDynamic range: Demonstrating the capacity to drive both strategy and execution, adapting swiftly to new data and changing priorities.\n\nHere’s What You’ll Bring to the Table:\n\nPh.D. (2+ years in immunology or related field) or MSc with more than 4-6 years’ experience in conducting assay validation in clinical Immunology under GLP/GCLP environment.\n\nA background in infections in diseases or oncology and experience with handling laboratory pathogens as containment level 3 is an advantage.\n\nExperience wilt single and multi-plex assays including MSD platform.\n\nStrong level of understanding and expertise in design and executing immune-related studies and assays\n\nThe ability to work in a cross-functional work environment is critical; strong leadership skills and independence skills are expected.\n\nExcellent written, presentation and interpersonal communication skills; ability to influence and collaborate in a team environment and with external stakeholders.\n\nCandidate will be curious in exploring new technology, bold in proposing creative experimental designs and ideas. Will work collaboratively with multifunctional teams and will be relentless in pursuing successful outcomes\n\nPossess strong computational skills, preferably experienced with Word, Excel, Power Point, GraphPad Prism\n\nKnowledge of system software for data analysis and statistical analysis.\n\nExperience of working in a regulated environment GLP, GCP, ISO standards is preferred.\n\nModerna offers personalized benefit programs and well-being resources as unique as our global workforce so employees can do their best work.\n\nWe recognize and appreciate your diverse needs and interests and do our best to support you at work and at home with:\n\nQuality healthcare and insurance benefits\nLifestyle Spending Accounts to create your own pathway to well-being\nFree premium access to fitness, nutrition, and mindfulness classes\nFamily planning and adoption benefits\nGenerous paid time off, including vacation, bank holidays, volunteer days, sabbatical, and a discretionary year-end shutdown\nEducational resources\nSavings and investments\nLocation-specific perks and extras!\n\nThe benefits offered may vary depending on the nature of your employment with Moderna and the country where you work.\n\nAbout Moderna\n\nSince our founding in 2010, we have aspired to build the leading mRNA technology platform, the infrastructure to reimagine how medicines are created and delivered, and a world-class team. We believe in giving our people a platform to change medicine and an opportunity to change the world. \n\nBy living our mission, values, and mindsets every day, our people are the driving force behind our scientific progress and our culture. Together, we are creating a culture of belonging and building an organization that cares deeply for our patients, our employees, the environment, and our communities.\n\nWe are proud to have been recognized as a Science Magazine Top Biopharma Employer, a Fast Company Best Workplace for Innovators, and a Great Place to Work in the U.S.\n\nAs we build our company, we have always believed an in-person culture is critical to our success. Moderna champions the significant benefits of in-office collaboration by embracing a 70/30 work model. This 70% in-office structure helps to foster a culture rich in innovation, teamwork, and direct mentorship. Join us in shaping a world where every interaction is an opportunity to learn, contribute and make a meaningful impact.\n\nIf you want to make a difference and join a team that is changing the future of medicine, we invite you to visit modernatx.com/careers to learn more about our current opportunities.\n\nModerna is a smoke-free, alcohol-free and drug-free work environment.\n\nModerna is a place where everyone can grow. If you meet the Basic Qualifications for the role and you would be excited to contribute to our mission every day, please apply!\n\nModerna is committed to equal employment opportunity and non-discrimination for all employees and qualified applicants without regard to a person's race, color, sex, gender identity or expression, age, religion, national origin, ancestry or citizenship, ethnicity, disability, military or protected veteran status, genetic information, sexual orientation, marital or familial status, or any other personal characteristic protected under applicable law. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.\n\nBelonging, Inclusion, and Diversity are critical to the success of our company and our impact on society. We’re focused on attracting, retaining, developing, and advancing our employees and believe that by cultivating diverse experiences, backgrounds, and ideas, we can provide an environment where every employee is able to contribute their best.\n\nModerna is committed to offering reasonable accommodations or adjustments to qualified job applicants with disabilities. Any applicant requiring an accommodation or adjustment in connection with the hiring process and/or to perform the essential functions of the position for which the applicant has applied should\n\ncontact the Accommodations and Adjustments team at leavesandaccommodations@modernatx.com.\n\n-",
      "insights": "No insights found",
      "minimum_qualifications": "",
      "preferred_qualifications": "",
      "responsibilities": "",
      "salary": ""
    }
  ]
}